Revit 2024 API
BuiltInFailures.SweepFailures.SweepFailedError Property
 Proper sweep geometry creation failed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SweepFailedError { get; }
Visual Basic
Public Shared ReadOnly Property SweepFailedError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SweepFailedError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SweepFailures Class
Autodesk.Revit.DB Namespace